{"posts":[{"title":"Flappy Bird game development based on FPGA","text":"This project develops Flappy Bird game based on Artix-7 FPGA chip, realizes the use of network port and HDMI interface. The overall framework of the project is shown in Fig. 9. The control information is transmitted through the network port, and the data packets using the UDP protocol are disassembled layer by layer to obtain valid data, and the LED light is used to indicate. ‘W’, ‘A’ and ‘D’ control the upper, left and right movements respectively, and ‘S’ controls the start of the game.The game logic is implemented by state machine. The FPGA records the position of the bird and calculates the position of the next frame according to the control information, generates the image of the current frame according to the position of the bird and the background position, and transmits it to the HDMI interface.The HDMI interface converts the VGA sequential image into an HDMI sequential image and transmits it to the display to display the game screen","link":"/2022/06/01/Bird/"},{"title":"Underactuated adaptive manipulator design","text":"GitHub. Inspired by the structure of the human hand, the underactuated adaptive robotic arm aims to achieve adaptive and stable grasping of objects with different shapes, materials, and weights, all within a small volume, low power, and simple mechanical structure. This also addresses the current challenges in the logistics industry regarding efficient mechanized automated sorting. Our project is based on the Model T robotic hand proposed by Yale University’s OpenHand project team [5], with additional functionalities and improvements made to the mechanical structure, specifically tailored for the complex sorting scenarios in large-scale e-commerce warehouses. Model diagrams and physical images are depicted in Fig. 9. The servo motor controls the positions of Finger A and Finger B, enabling two gripping modes: parallel grasping (AB fingers together) or separate grasping (AB fingers apart). In this setup, both Finger A and Finger B are controlled by a single motor, referred to as Motor A. The underactuated grasping is achieved through a differential mechanism composed of a linear drive and pulley system. hexo cleanhexo generatehexo deploy","link":"/2020/01/01/Underactuated%20adaptive%20manipulator%20design/"}],"tags":[{"name":"FPGA","slug":"FPGA","link":"/tags/FPGA/"},{"name":"Verilog","slug":"Verilog","link":"/tags/Verilog/"},{"name":"Mechanical design","slug":"Mechanical-design","link":"/tags/Mechanical-design/"}],"categories":[{"name":"Course project","slug":"Course-project","link":"/categories/Course-project/"}],"pages":[]}