{"posts":[{"title":"3D printing data processing and support generation algorithm based on MATLAB","text":"Date: March – June 2022 (Course project) Based on MATLAB, this algorithm processes 3D printing data and generates supports. This project utilizes a half-edge data structure to store point and face information of the 3D model. The support structures are generated using the point and face information along with user-defined parameters. The results are displayed to the user through a graphical user interface (GUI), allowing for interactive interactions. MethodologyThis is a project involving a 3D printing support algorithm developed using MATLAB. We have created a GUI interface that allows users to adjust support parameters. Users can determine the surfaces for which supports are needed using “Input Angle,” control the support generation density with “Resolution,” and adjust the radius of support generation using “Support Radius.” Once the parameters are set, users can click on “Input File” to read the 3D printing file. The system stores point and face information in a half-edge data structure. Clicking on “Columnar Support” or “Tree Support” generates column-like or tree-like supports, respectively. “Support Section” generates cross-sectional information of the model. ResultTree-like support and column-like support are generated as shown in Fig 1. GitHub Link Here.","link":"/2020/06/03/3D/"},{"title":"Simulation and analysis of 3-RPR parallel robot","text":"Date: September – December 2020 (Course project) We conducted analysis and simulation of an assistive parallel robot mentioned in ref [1-2].The kinematic analysis and mechanical strength verification are realized. Methodology This robot system mainly consists of a base, a platform, and three driving links. The motion platform of the parallel robot is supported by three arm structures with consistent kinematics. Each arm is composed of a sequential arrangement of a rotational joint (R), a drivable prismatic joint (P), and another rotational joint (R), connecting the mobile base and the robot motion platform. With respect to the mechanical structure model, we conducted kinematic and differential kinematic analysis as well as workspace visualization. In order to verify the structural strength of the model, ANSYS simulation analysis is used. The connection at the articulation is simplified, and the simplified model obtained is shown in Fig 2. Finally, we conducted joint dynamic simulations of the model using a combination of ADAMS and MATLAB. Simple PD controllers showed poor tracking performance under different conditions, especially in the presence of measurement noise and external disturbances. To compensate for these effects, a feedforward term was added to the controller architecture. This term is obtained by computing the feedforward torque through the robotic arm’s dynamic model and mapping it into the joint space: The closed-loop dynamic equation of the robotic arm in joint space is given by: From this, the control block diagram can be derived as shown in Fig 3. There is a simulation result of single degree of freedom control for Link 3. Result GitHub Link Here. References[1] A. Asker, S. F. M. Assal and A. M. Mohamed, “Dynamic Analysis of a Parallel Manipulator-Based Multi-function Mobility Assistive Device for Elderly,” 2015 IEEE International Conference on Systems, Man, and Cybernetics, Hong Kong, China, 2015, pp. 1409-1414, doi: 10.1109/SMC.2015.250. [2] A. Asker and S. F. M. Assal, “Kinematic analysis of a parallel manipulator-based multi-function mobility assistive device for elderly,” 2015 IEEE International Conference on Advanced Intelligent Mechatronics (AIM), Busan, Korea (South), 2015, pp. 676-681, doi: 10.1109/AIM.2015.7222615.","link":"/2020/12/07/3RPR/"},{"title":"Development of a Modular Array Eddy Current Online Inspection System","text":"Date: March 2022 – present (Master project) This is my master’s project. The development of modular array eddy current online inspection system involves circuit design, software programming and data analysis. Circuit design: DSP, ZYNQ, AD/DA chip, adjustable gain amplification (VGA). Software development: (DSP) AD acquisition, digital filtering, SPI interface DA output; (ZYNQ) SPI interface AD collection, DMA transmission, network port transmission based on FreeRTOS system. Methodology These are the three steps of detection, the PCB design is shown in Fig 2: Eddy current excitation and detection signal preprocessing module: This module is mainly composed of STM32 and CPLD. The STM32 controls the CPLD to generate a sinusoidal excitation signal and send it to the probe. The detection coil picks up the detection signal excited by the probe and demodulates the defect signal through phase-sensitive detection (PSD). Digital filtering and gain control module: The detected weak defect signal (peak-to-peak value is about 100mV) is digitally filtered in DSP(TMS320F28377D) and amplified by an variable gain amplifier (AD8338) to obtain a high SNR defect signal. Main control module: The module uses ZYNQ-7000 to control AD acquisition chip to obtain defect signal, and communicates with upper computer based on LwIP network protocol of FreeRTOS system, uploads defect signal to upper computer, and obtains control information of the system from upper computer. ResultThe PCB currently supports processing speeds of up to 8 channels at 200kHz. The Fig 3 is the acquisition result of testing the hole defects of copper pipes by means of through type eddy current testing. The hole sizes range from 0.3 mm-1.15 mm. | | || —- | —-|","link":"/2023/09/07/ECT/"},{"title":"Defect Size evaluation in Eddy Current Testing through Wavelet Transform and Pseudo-color Enhancement(Working Paper)","text":"Date: April – September 2023 The purpose of this project is to invert the defect size according to the collected eddy current signal, process the timing signal through neural network and time-frequency domain analysis, and obtain the inversion result. Highlights A comprehensive through-type eddy current detection system has been developed for the detection of sub-millimeter level defects and estimation of defect size. The combination of the continuous wavelet transform and a pseudo-color enhancement algorithm is employed to enhance the distinguishability of signals with similar defect sizes. CNN regression models have been utilized to achieve high-precision defect size estimation. This methodology can be transferred to other non-destructive testing scenarios with similar waveform characteristics. OverviewFig. 1 illustrates the framework in the paper. The overall structure consists of two parts: the acquisition of defect signals in the hardware system and the processing algorithms for the data. Hardware system: A through-type eddy current probe is used for detecting defects in copper tubes. The probe consists of two layers of coils: an outer excitation coil, which is responsible for generating an alternating magnetic field, and two inner differential detection coils, which are used to pick up the generated eddy current signals. The signal processing circuit utilizes phase-sensitive detection to demodulate the resistive and reactive components of the eddy current signal. This paper processes the demodulated signal using a digital signal processing (DSP) chip, employing infinite impulse response (IIR) digital filtering for more precise noise removal. The signal processing circuit utilizes an adjustable gain amplifier to amplify the detection signal. Finally, the collected signal is uploaded to the host computer via the ZYNQ-7020 chip for further algorithmic analysis. Processing algorithm: After the host computer acquires the defect signal, the peak-finding algorithm is used to segment the defect region, and the wavelet transform is applied to obtain the corresponding time-frequency matrix of the defect signal. The pseudo-color enhancement algorithm converts the original time-frequency matrix into an RGB image in order to enhance the retention of information. Finally, the RGB image is sent to CNN regression models for calculating the defect size. Detection SystemAs shown in Fig. 2, the experimental specimen is a copper tube with six evenly spaced holes machined at specific positions. The specimen in the experimental detection system is driven by a servo motor (SIMOTICS S-1FL6) to undergo reciprocating motion on a guide rail. By setting the acceleration and maximum velocity, the specimen can maintain a constant speed within the defect region. ResultTwo methods are repeated for comparison: Method 1 [1]: Input the timing signal into 1D-CNN to obtain the size estimation result. Method 2 [2]: Perform principal component analysis on the timing signal and input the principal component into ANN to estimate the defect size. According to Table Ⅰ, the trained models were evaluated on the test dataset to obtain their predictions in terms of accuracy, MSE, and mean absolute error (MAE). The ±0.01 mm accuracy rate of the model is defined as the proportion of accurate regressions, where the regression values have an absolute error within the range of 0.01 mm. It is calculated by dividing the number of accurate regressions by the total number of regressions. It represents the model’s ability to accurately estimate aperture sizes with a specific precision. The accuracy rate indicates the percentage of accurate predictions out of the total predictions made by the model. This method achieves a precision of ±0.025 mm for nearly 100% of the data, meaning it can correctly classify 15 different aperture sizes. Furthermore, the predictions within ±0.01mm error range exceed 90%. Table Ⅰ Different Network and Dataset Results Automatic thickness recognition using pulse eddy currentThe proposed regression method can be applied to other non-destructive testing tasks, particularly in scenarios where distinguishing signals with similar waveforms is challenging. It exhibits a certain degree of scalability. Pulse eddy current (PEC) testing is utilized to measure the thickness of metal plates, and datasets for various lift-off distances are available [3]. As shown in Fig.3, the material being tested is aluminum plate, with thicknesses ranging from 20 mm to 60 mm, and lift-off distances ranging from 0mm to 15 mm.The parameters are set as described in the previous chapters, and the HSI pseudo-color enhancement algorithm is employed. We use VGG16-R to analyze the dataset. The MAE for all thicknesses is 0.5770 mm, demonstrating high-precision thickness detection. References[1] F. Xin, Z. Chengkai, P. Xiang, J. Lihua, and L. Zheng, “Towards end-to-end pulsed eddy current classification and regression with CNN,” 2019 IEEE International Instrumentation and Measurement Technology Conference (I2MTC), Conference Paper pp. 5 pp.-5 pp., 2019 2019, doi: 10.1109/i2mtc.2019.8826858. [2] R. Cormerais, R. Longo, A. Duclos, G. Wasselynck, and G. Berthiau, “Non destructive Eddy Currents inversion using Artificial Neural Networks and data augmentation,” NDT &amp; E International, vol. 129, p. 102635, 2022/07/01/ 2022, doi: https://doi.org/10.1016/j.ndteint.2022.102635. [3] T. Meng, L. Xiong, X. Zheng, Z. Xia, X. Liu, Y. Tao, W. Yang, and W. Yin, “Real-time Automatic Thickness Recognition Using Pulse Eddy Current with Deep Learning.” 2023 IEEE International Instrumentation and Measurement Technology Conference (I2MTC), Kuala Lumpur, Malaysia, 2023, pp. 1-6, doi: 10.1109/I2MTC53148.2023.10175900.","link":"/2023/07/07/CNN/"},{"title":"RoboMaster University Championship 2019","text":"Date: September 2018 – August 2019 RoboMaster University Championship (RMUC) focuses on the comprehensive application of science and technology and engineering practice ability of the participants. RMUC fully integrates “machine vision”, “embedded system design”, “mechanical control”, “inertial navigation”, “human-computer interaction” and many other robot-related technical disciplines. I attended the 2019 RMUC and designed the mechanical structure of the infantry robot head, as shown in Fig 1,2. The head is a two-axis mechanism, similar to a camera gimbal, with a launch mechanism that can fire round projectiles. Our team won the final runner-up.","link":"/2019/08/07/Robomaster/"},{"title":"Underactuated adaptive manipulator design","text":"Date: September 2019 – January 2020 (Course project) Inspired by the structure of the human hand, the underactuated adaptive robotic arm aims to achieve adaptive and stable grasping of objects with different shapes, materials, and weights, all within a small volume, low power, and simple mechanical structure. Methodology Our project is based on the Model T robotic hand proposed by Yale University’s OpenHand project team [1], with additional functionalities and improvements made to the mechanical structure, specifically tailored for the complex sorting scenarios in large-scale e-commerce warehouses. Model diagrams and physical images are depicted in the figure. The servo motor controls the positions of Finger A and Finger B, enabling two gripping modes: parallel grasping (AB fingers together) or separate grasping (AB fingers apart). In this setup, both Finger A and Finger B are controlled by a single motor, referred to as Motor A. The underactuated grasping is achieved through a differential mechanism composed of a linear drive and pulley system. References[1] R. R. Ma, L. U. Odhner and A. M. Dollar, “A modular, open-source 3D printed underactuated hand,” 2013 IEEE International Conference on Robotics and Automation, Karlsruhe, Germany, 2013, pp. 2737-2743, doi: 10.1109/ICRA.2013.6630954.","link":"/2020/01/01/hand/"},{"title":"Multi-target recognition and detection algorithm of unmanned vehicles","text":"Date: February 2021 - June 2021 (Bachelor project) The project is a part of the development of virtual test environment for unmanned vehicles and the verification of perception control strategy, including image recognition, LiDAR perception, trajectory planning and vehicle control. MethodologyThe overall structure of the project is shown in Fig 1. The purpose of developing the virtual test environment is to simulate and verify the vehicle control strategy based on the perception virtual environment. However, due to the limited time, only the offline testing of the perception part is realized. The virtual environment is shown in Fig 2. The main work of this paper is image recognition, using cameras to obtain road information and multi-target recognition, including lane lines, pedestrians and vehicles. The project uses the image obtained by OpenCV to process and estimate the distance between the lane line and the vehicle. ResultThe lane line is marked by the lavender color in the lower left corner. The combination of YOLOv5+DeepSort was adopted to detect pedestrians and vehicles. Pedestrians and vehicles were selected by the green box in the upper left corner.","link":"/2021/06/03/car/"},{"title":"Flappy Bird game development based on FPGA","text":"Date: March – June 2022 (Course project) This project develops Flappy Bird game based on Artix-7 FPGA chip, realizes the use of network interface and HDMI interface. Methodology The overall framework of the project is shown in Fig 1. The control information is transmitted through the network interface, and the data packets using the UDP protocol are disassembled layer by layer to obtain valid data, and the LED light is used to indicate. ‘W’, ‘A’ and ‘D’ control the upper, left and right movements respectively, and ‘S’ controls the start of the game.The game logic is implemented by state machine. The FPGA records the position of the bird and calculates the position of the next frame according to the control information, generates the image of the current frame according to the position of the bird and the background position, and transmits it to the HDMI interface.The HDMI interface converts the VGA sequential image into an HDMI sequential image and transmits it to the display to display the game screen. Result GitHub Link Here.","link":"/2022/06/01/Bird/"},{"title":"Visual measurement of workpiece dimensions","text":"Date: September – December 2019 (Course project) In this project, industrial cameras are used to capture workpiece images, and image binarization is preprocessed in OpenCV. Hough linear transform is used to extract the edge of the workpiece, and Hough circular transform is used to extract the circular size inside the workpiece. ResultThe measurement results are basically correct as shown in Fig 1. Real Length/mm Measuring result/mm Distance 1 5 5.00594 Distance 2 5 4.96313 Distance 3 5 5.01501 Length 1 15 14.9822 Length 2 20 19.9525 Length 3 25 24.9516 Diameter 6 6.02037","link":"/2019/12/03/measure/"},{"title":"Siasun-SR10A-Robot analysis and force feedback control simulation","text":"Date: March – August 2020 (Course project) In this project, D-H modeling method is used to conduct mathematical modeling for the industrial six-axis robot arm. On this basis, the admittance controller based on the end sensor is designed, and the simulation of SINMULINK force position hybrid control in the end peg-in-hole assembly process is completed. MethodologyThe robot model is shown in Fig 1. In the process of peg-in-hole assembly, a hybrid control of force position is adopted. The diagonal selection matrix S determines the specific control mode, P and W represent the position control law and the force control law respectively, and U represents the controller output, as shown in Fig 2. The peg-in-hole assembly is divided into the approach stage (position control), the hole search stage (force position mixed control) and the jack stage (force control), the hole search stage needs to ensure that the Z-axis direction of the shaft and the plane contact is a constant contact force of the flexible control. SIMULINK design block diagram is shown below. ResultSIMULINK simulation results are shown in Fig 4 and Fig 5. GitHub Link Here.","link":"/2020/08/01/robot/"},{"title":"Shihao’s Personal Homepage","text":"Shihao Dong is currently pursuing his Master’s degree in embedded systems at Tsinghua University (THU). He received his Bachelors’s degree from SJTU and graduated from the Hsue-shen Tsien Honored Program (Top 5%). He is now supervised by Prof. Zandong Han. His research interests involve embedded systems development, neural network and signal processing algorithm development. He is also fascinated with lightweight network on-chip deployment and neural network FPGA acceleration. Designing lightweight signal processing network and using FPGA to accelerate processing are the next research goals. He is proficient in mechanics, electronics, hardware and software: Mechanics: Machining design:SolidWorks, AutoCAD CAE : ADAMS, ANSYS, ABAQUS Machining: 3D printing, Laser Cutting, Numerical control machining Electronics: Altium Designer Signal processing, Analog/Digital circuits, Digital filtering Hardware/Software: Decent: MATLAB | Python | Verilog | VHDL | C | C++ Chipsets: DSP, ZYNQ, FPGA, STM32","link":"/2023/10/01/person/"}],"tags":[{"name":"MATLAB","slug":"MATLAB","link":"/tags/MATLAB/"},{"name":"Robot","slug":"Robot","link":"/tags/Robot/"},{"name":"ANSYS","slug":"ANSYS","link":"/tags/ANSYS/"},{"name":"SolidWorks","slug":"SolidWorks","link":"/tags/SolidWorks/"},{"name":"Altium Designer","slug":"Altium-Designer","link":"/tags/Altium-Designer/"},{"name":"Verilog","slug":"Verilog","link":"/tags/Verilog/"},{"name":"FPGA","slug":"FPGA","link":"/tags/FPGA/"},{"name":"C&#x2F;C++","slug":"C-C","link":"/tags/C-C/"},{"name":"CNN","slug":"CNN","link":"/tags/CNN/"},{"name":"Python","slug":"Python","link":"/tags/Python/"},{"name":"OpenCV","slug":"OpenCV","link":"/tags/OpenCV/"},{"name":"ROS","slug":"ROS","link":"/tags/ROS/"},{"name":"Interface","slug":"Interface","link":"/tags/Interface/"},{"name":"SIMULINK","slug":"SIMULINK","link":"/tags/SIMULINK/"}],"categories":[{"name":"Algorithm development","slug":"Algorithm-development","link":"/categories/Algorithm-development/"},{"name":"Mechanical design","slug":"Mechanical-design","link":"/categories/Mechanical-design/"},{"name":"Signal processing","slug":"Signal-processing","link":"/categories/Signal-processing/"},{"name":"Personal Homepage","slug":"Personal-Homepage","link":"/categories/Personal-Homepage/"},{"name":"Hardware","slug":"Hardware","link":"/categories/Hardware/"}],"pages":[]}